w5_mk_semi_lattice/readme.org
#+OPTIONS: ^:{}
#+STARTUP: indent nolineimages overview num
#+TITLE: mk semi lattice
#+AUTHOR: Shigeto R. Nishitani
#+EMAIL:     (concat "shigeto_nishitani@mac.com")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* install
- cd multi_scale_25f
- git stash
- git pull origin main
- cat w5_mk_semi_lattice/readme.org

see ** ruby2d install

- cp bin/linux_bins/wsl_ubuntu/open ~/bin
- cd 
- git clone git@github.com:daddygongon/mk_semi_lattice.git
- cd mk_semi_lattice
- sudo rake install:local


* names
- hyper_card :: B5ベースの知識集約カードシステム
- semi_lattice :: ruby2dで作る新しいリンク表示
- knowledge_fixer :: 知識定着の概念
  - pattern language
  - SQ3R
  - chunking

* semi_lattice dev. todos[7/7]
- [X] archivesの完結
- [X] semi_lattice定着
  - リゾーム？, nodeではなくedgeに意味あり
- [X] dirとknowledgeの統一
- [X] bin化(mk_semi_lattice)
- [X] dirのドット化
  - .semi_lattice/
    - dir.yaml
    - dir_node_edge.yaml
    - dir_semi_lattice.yaml
    - semi_lattice.yaml
- [X] link化
- [X] windows...
* dir structures
- dir構成をAI提案
- semi lattice rules
  - tight binding
  - 5 pm 2
  - week,step,rev:num_names
  - contents(toc)
    - code, usage, data, results(imrad)
      - intro
      - method
      - results and
      - discuss
      - summary
      - supplements
    - man in linux
      - NAME（名前） - コマンドや関数の名前とその機能を一行で説明する文。
      - SYNOPSIS（書式） - コマンドの場合、コマンド行のオプションを含めた形式定義。関数の場合、定義のあるヘッダファイルの指定とプロトタイプ宣言形式の定義。
      - DESCRIPTION（説明） - コマンドや関数(option)についての具体的な説明。
      - EXAMPLES（例） - 使用法の具体例。
      - SEE ALSO（関連項目） - 関連するコマンドや関数のリスト。

* HyperCard
- PreHyperCard
  - Mac
    - Mouse, Icon, WYSIWYG, Desktop, PullDownMenu
- PostHyperCard
  - != html(link...)
  - www
  - wiki(巻物)
- HyperCard
  - [[https://qiita.com/daddygongon/items/dcf50940f04fb34c5c53][知識の構造(ツリーではない)--qiita]]
    - Tree == MindMap
  - chunking(7 $\pm$ 2)
  - 知的生産の技術(梅棹)
    - 京大(B5)カード, 記憶の代わりに記録
  - toggle表示
    - Acta
    - enCapsule(隠蔽)
      - object指向(思考)
      - Inherit (遺産継承)
      - PolyMorph(多形, morpheme, phoneme)
    
* ruby2d install
only for win11.

#+begin_src bash
# sudo apt-get install gcc libxml2-dev libcurl4-gnutls-dev ruby-dev
sudo apt update
sudo apt upgrade
sudo apt-get install -y build-essential libssl-dev zlib1g-dev libreadline-dev
sudo apt-get install rbenv
sudo apt install libsdl2-dev libsdl2-image-dev libsdl2-mixer-dev libsdl2-ttf-dev
sudo gem install ruby2d

cd multi_scale_25f/
#+end_src

- [[https://www.ruby2d.com/learn/linux/#install-packages][linux necessaries]]

* rake mk_graph
** Usage
- rake mk_graph

これでgraphができる．
それをcaptureしてみせる．．．

** Description:
1. 'ruby codes/mk_dir_array.rb -L 2 .'
   - カレントディレクトリ以下2階層のディレクトリ構造をdir.yamlに出力
2. 'ruby codes/mk_node_edge.rb dir.yaml > node_edge.txt'
   - dir.yamlからノード・エッジ情報をnode_edge.txtに出力
3. 'ruby codes/knowledge_fixer.rb node_edge.txt'
   - node_edge.txtを使ってknowledge fixerを実行
