w5_mk_semi_lattice/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2025-10-21 Tue 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mk semi lattice</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">mk semi lattice</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb85360a">1. install</a></li>
<li><a href="#org0864de8">2. names</a></li>
<li><a href="#org2c4597e">3. semi_lattice dev. todos<code>[7/7]</code></a></li>
<li><a href="#org2a5d47d">4. dir structures</a></li>
<li><a href="#orge6e854e">5. HyperCard</a></li>
<li><a href="#org47bccc2">6. ruby2d install</a></li>
<li><a href="#orgd371cf7">7. rake mk_graph</a>
<ul>
<li><a href="#org976f35c">7.1. Usage</a></li>
<li><a href="#org2ebdfe2">7.2. Description:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb85360a" class="outline-2">
<h2 id="orgb85360a"><span class="section-number-2">1.</span> install</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>cd multi_scale_25f</li>
<li>git stash</li>
<li>git pull origin main</li>
<li>cat w5_mk_semi_lattice/readme.org</li>
</ul>

<p>
see ** ruby2d install
</p>

<ul class="org-ul">
<li>cp bin/linux_bins/wsl_ubuntu/open ~/bin</li>
<li>cd</li>
<li>git clone git@github.com:daddygongon/mk_semi_lattice.git</li>
<li>cd mk_semi_lattice</li>
<li>sudo rake install:local</li>
</ul>
</div>
</div>
<div id="outline-container-org0864de8" class="outline-2">
<h2 id="org0864de8"><span class="section-number-2">2.</span> names</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>hyper_card</dt><dd>B5ベースの知識集約カードシステム</dd>
<dt>semi_lattice</dt><dd>ruby2dで作る新しいリンク表示</dd>
<dt>knowledge_fixer</dt><dd>知識定着の概念
<ul class="org-ul">
<li>pattern language</li>
<li>SQ3R</li>
<li>chunking</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-org2c4597e" class="outline-2">
<h2 id="org2c4597e"><span class="section-number-2">3.</span> semi_lattice dev. todos<code>[7/7]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="on"><code>[X]</code> archivesの完結</li>
<li class="on"><code>[X]</code> semi_lattice定着
<ul class="org-ul">
<li>リゾーム？, nodeではなくedgeに意味あり</li>
</ul></li>
<li class="on"><code>[X]</code> dirとknowledgeの統一</li>
<li class="on"><code>[X]</code> bin化(mk_semi_lattice)</li>
<li class="on"><code>[X]</code> dirのドット化
<ul class="org-ul">
<li>.semi_lattice/
<ul class="org-ul">
<li>dir.yaml</li>
<li>dir_node_edge.yaml</li>
<li>dir_semi_lattice.yaml</li>
<li>semi_lattice.yaml</li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> link化</li>
<li class="on"><code>[X]</code> windows&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org2a5d47d" class="outline-2">
<h2 id="org2a5d47d"><span class="section-number-2">4.</span> dir structures</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>dir構成をAI提案</li>
<li>semi lattice rules
<ul class="org-ul">
<li>tight binding</li>
<li>5 pm 2</li>
<li>week,step,rev:num_names</li>
<li>contents(toc)
<ul class="org-ul">
<li>code, usage, data, results(imrad)
<ul class="org-ul">
<li>intro</li>
<li>method</li>
<li>results and</li>
<li>discuss</li>
<li>summary</li>
<li>supplements</li>
</ul></li>
<li>man in linux
<ul class="org-ul">
<li>NAME（名前） - コマンドや関数の名前とその機能を一行で説明する文。</li>
<li>SYNOPSIS（書式） - コマンドの場合、コマンド行のオプションを含めた形式定義。関数の場合、定義のあるヘッダファイルの指定とプロトタイプ宣言形式の定義。</li>
<li>DESCRIPTION（説明） - コマンドや関数(option)についての具体的な説明。</li>
<li>EXAMPLES（例） - 使用法の具体例。</li>
<li>SEE ALSO（関連項目） - 関連するコマンドや関数のリスト。</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge6e854e" class="outline-2">
<h2 id="orge6e854e"><span class="section-number-2">5.</span> HyperCard</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>PreHyperCard
<ul class="org-ul">
<li>Mac
<ul class="org-ul">
<li>Mouse, Icon, WYSIWYG, Desktop, PullDownMenu</li>
</ul></li>
</ul></li>
<li>PostHyperCard
<ul class="org-ul">
<li>!= html(link&#x2026;)</li>
<li>www</li>
<li>wiki(巻物)</li>
</ul></li>
<li>HyperCard
<ul class="org-ul">
<li><a href="https://qiita.com/daddygongon/items/dcf50940f04fb34c5c53">知識の構造(ツリーではない)&#x2013;qiita</a>
<ul class="org-ul">
<li>Tree == MindMap</li>
</ul></li>
<li>chunking(7 \(\pm\) 2)</li>
<li>知的生産の技術(梅棹)
<ul class="org-ul">
<li>京大(B5)カード, 記憶の代わりに記録</li>
</ul></li>
<li>toggle表示
<ul class="org-ul">
<li>Acta</li>
<li>enCapsule(隠蔽)
<ul class="org-ul">
<li>object指向(思考)</li>
<li>Inherit (遺産継承)</li>
<li>PolyMorph(多形, morpheme, phoneme)</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org47bccc2" class="outline-2">
<h2 id="org47bccc2"><span class="section-number-2">6.</span> ruby2d install</h2>
<div class="outline-text-2" id="text-6">
<p>
only for win11.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">sudo apt-get install gcc libxml2-dev libcurl4-gnutls-dev ruby-dev</span>
sudo apt update
sudo apt upgrade
sudo apt-get install -y build-essential libssl-dev zlib1g-dev libreadline-dev
sudo apt-get install rbenv
sudo apt install libsdl2-dev libsdl2-image-dev libsdl2-mixer-dev libsdl2-ttf-dev
sudo gem install ruby2d

<span style="color: #cd6600;">cd</span> multi_scale_25f/
</pre>
</div>

<ul class="org-ul">
<li><a href="https://www.ruby2d.com/learn/linux/#install-packages">linux necessaries</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd371cf7" class="outline-2">
<h2 id="orgd371cf7"><span class="section-number-2">7.</span> rake mk_graph</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org976f35c" class="outline-3">
<h3 id="org976f35c"><span class="section-number-3">7.1.</span> Usage</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>rake mk_graph</li>
</ul>

<p>
これでgraphができる．
それをcaptureしてみせる．．．
</p>
</div>
</div>
<div id="outline-container-org2ebdfe2" class="outline-3">
<h3 id="org2ebdfe2"><span class="section-number-3">7.2.</span> Description:</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>'ruby codes/mk_dir_array.rb -L 2 .'
<ul class="org-ul">
<li>カレントディレクトリ以下2階層のディレクトリ構造をdir.yamlに出力</li>
</ul></li>
<li>'ruby codes/mk_node_edge.rb dir.yaml &gt; node_edge.txt'
<ul class="org-ul">
<li>dir.yamlからノード・エッジ情報をnode_edge.txtに出力</li>
</ul></li>
<li>'ruby codes/knowledge_fixer.rb node_edge.txt'
<ul class="org-ul">
<li>node_edge.txtを使ってknowledge fixerを実行</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2025-10-21 Tue 17:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
